import random as rd

prods = ["мясо", "яйца", "молочная продукция", "мыло", "мех", "мед", "зелень", "овощи", "хумус",
           "каши", "древесина", "семена", "бетон", "металлические гвозди", "упаковки", "одежда",
           "аксессуары из вторсырья", "плитка", "камень", "минеральная вода", "щебенка"]
fac1 = []
fac2 = []

n = int(input("Введите количество товара на первой фабрике: "))
for i in range(n):
    fac1.append(rd.choice(prods))
print("Весь товар на 1 фабрике: ", fac1)

n = int(input("Введите количество товара на второй фабрике: "))
for i in range(n):
    fac2.append(rd.choice(prods))
print("Весь товар на 2 фабрике: ", fac2)

# myset = list(set(factory1) & set(factory2))
print("Товары, которые повторяются на двух фабриках: ", list(set(fac1) & set(fac2)))
print("Товары, которые не повторяются на двух фабриках: ", list(set(fac1) ^ set(fac2)))

